; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph3 - mode
	thermograph1 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star2 - direction
	Star6 - direction
	Star9 - direction
	Star8 - direction
	Star5 - direction
	Star1 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star3 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument2 infrared0)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
)
(:goal (and
	(have_image Planet10 infrared2)
	(have_image Star12 infrared2)
	(have_image Star13 spectrograph3)
	(have_image Star14 infrared2)
	(have_image Star15 spectrograph3)
	(have_image Star16 spectrograph3)
))

)

; plan
1. (turn_to satellite0 groundstation4 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star12)
   goals met: 0 of 6
5. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 1 of 6
6. (turn_to satellite0 planet10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet10)
   goals met: 1 of 6
7. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 2 of 6
8. (turn_to satellite0 star13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star13)
   goals met: 2 of 6
9. (take_image satellite0 star13 instrument0 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 3 of 6
10. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 3 of 6
11. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   goals met: 4 of 6
12. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 4 of 6
13. (take_image satellite0 star15 instrument0 spectrograph3)
   added: (have_image star15 spectrograph3)
   goals met: 5 of 6
14. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 5 of 6
15. (take_image satellite0 star16 instrument0 spectrograph3)
   added: (have_image star16 spectrograph3)
   goals met: 6 of 6
